Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The reason for 2) is that the JVM is essentially running the compiler at runtime in parallel with the application itself. In the case of native executables the compiler is run ahead of time removing the need to run the compiler in parallel with the application.
ja_jp: 2)の理由は、JVMは基本的に実行時にアプリケーションと並行してコンパイラを実行しているからです。ネイティブ実行可能ファイルの場合、コンパイラは事前に実行されるため、アプリケーションと並行してコンパイラを実行する必要がありません。

source: The reason for this is that the local build driver invoked through `-Dquarkus.native.container-build=true` uses volume mounts to make the JAR available in the build container, but volume mounts do not work with remote daemons. The remote container build driver copies the necessary files instead of mounting them. Note that even though the remote driver also works with local daemons, the local driver should be preferred in the local case because mounting is usually more performant than copying.
ja_jp: その理由は、 `-Dquarkus.native.container-build=true` を通して起動されるローカルビルドドライバは、ビルドコンテナーで JAR を利用できるようにするためにボリュームマウントを使用しますが、ボリュームマウントはリモートデーモンでは機能しません。リモートコンテナーのビルドドライバは、必要なファイルをマウントするのではなく、コピーします。リモートドライバはローカルデーモンでも動作しますが、ローカルの場合はローカルドライバを使用した方が良いことに注意してください。なぜなら、マウントの方がコピーよりもパフォーマンスが高いからです。

source: The reason is that JAX-RS `@PathParam` relies on the `-parameters` compiler flag to be set to be able to map `{name}` to the `name` parameter.
ja_jp: これは、JAX-RS `@PathParam` は `{name}` を `name` パラメーターにマッピングできるように `-parameters` コンパイラフラグを設定することに依存しているためです。

source: The reason is that Quarkus REST (formerly RESTEasy Reactive) relies on the `-parameters` compiler flag to be set to be able to map `{name}` to the `name` parameter.
ja_jp: これは、Quarkus REST (旧 RESTEasy Reactive) が、 `{name}` を `name` パラメーターにマッピングできるように、 `-parameters` コンパイラーフラグが設定されていることに依存しているためです。

source: The reason is that RESTEasy Reactive relies on the `-parameters` compiler flag to be set to be able to map `{name}` to the `name` parameter.
ja_jp: これは、RESTEasy Reactive が `name` パラメータに `{name}` をマップできるようにするために `-parameters` コンパイラーフラグをセットすることに依存しているからです。

source: The reason is that, Quarkus may need to re-resolve application dependencies during the test phase to set up the test classpath for the tests. The original Maven resolver used in previous build phases will not be available in the test process and, as a conseqence, Quarkus will need to initialize a new one. To make sure the new resolver is initialized correctly, the relevant configuration options will need to be passed to the test process.
ja_jp: Quarkusでは、テストフェーズでアプリケーションの依存関係を再解決して、テスト用のクラスパスを設定する必要がある場合があるためです。 以前のビルドフェーズで使用された元のMavenリゾルバはテストプロセスでは使用できず、その結果、Quarkusは新しいリゾルバを初期化する必要があります。 新しいリゾルバが正しく初期化されるように、関連する設定オプションをテストプロセスに渡す必要があります。

source: The reason of this restriction is that `@QuarkusTest` starts a Quarkus server for the whole lifetime of the tests execution run, thus preventing the other tests to start their own Quarkus server.
ja_jp: この制限の理由は、 `@QuarkusTest` がテスト実行の期間全体にわたって Quarkus サーバーを起動するため、他のテストが独自の Quarkus サーバーを起動できないようにするためです。

source: The reason you have to add this property is because with the authorization code flow, Quarkus OIDC treats the ID token as the primary token that controls access to the application into where the user has logged in, it uses the access token to access downstream services as required by the application on behalf of the authenticated user who authorized the application to do it.
ja_jp: このプロパティーを追加する必要がある理由は、認可コードフローにおいて、Quarkus OIDC は ID トークンを、ユーザーがログインしたアプリケーションへのアクセスを制御するプライマリトークンとして扱うためです。アクセストークンは、アプリケーションが許可した認証済みユーザーに代わって、アプリケーションが必要に応じてダウンストリームサービスにアクセスするために使用されます。

source: The reasons why there are two such identifiers, and why they are not unique keys for the credentials themselves are:
ja_jp: このように識別子が2つ存在する理由、およびそれらがクレデンシャル自体のユニークキーでない理由は次のとおりです:

source: The received `tx` object can also be used to _discard_ the transaction, using `tx.discard()`. The returned `TransactionResult` lets you retrieve the result of each command.
ja_jp: 受け取った `tx` オブジェクトは、 `tx.discard()` を使用してトランザクションを _破棄_ するためにも使用できます。 返された `TransactionResult` を使用すると、各コマンドの結果を取得できます。

source: The received `tx` object can also be used to _discard_ the transaction, using: `tx.discard();`. The returned `TransactionResult` lets you retrieve the result of each command.
ja_jp: 受け取った `tx` オブジェクトは、 `tx.discard();` を使用してトランザクションを _破棄_ するために使用することもできます。返された `TransactionResult` により、各コマンドの結果を取得することができます。

source: The recipe might not include a specific item in your project.
ja_jp: レシピには、あなたのプロジェクトの特定のアイテムが含まれていないかもしれません。

source: The recommended GraalVM version is now GraalVM 20.3.1.
ja_jp: GraalVMの推奨バージョンはGraalVM 20.3.1になりました。

source: The recommended approach for informing clients and servers about the certificate reload is to fire a CDI event of type `io.quarkus.tls.CertificateUpdatedEvent`. To do so, inject a CDI event of this type and fire it when a reload occurs.
ja_jp: 証明書のリロードについてクライアントとサーバーに通知する方法としては、 `io.quarkus.tls.CertificateUpdatedEvent` タイプの CDI イベントを起動する方法が推奨されます。 これを行うには、このタイプの CDI イベントを注入し、再読み込みが発生したときにそれを起動します。

source: The recommended approach for testing against databases is to use the same database as production to get test results that match production behavior as closely as possible. xref:databases-dev-services.adoc[Dev Services] simplifies this approach by requiring no configuration and starting quickly.
ja_jp: データベースに対するテストの推奨されるアプローチは、本番環境の動作と可能な限り一致するテスト結果を得るために、本番環境と同じデータベースを使用することです。 xref:databases-dev-services.adoc[Dev Services] は、設定が不要で素早く起動できるため、このアプローチを簡素化します。

source: The recommended approach is to use the database intended for production to get results as close as possible to a production environment. This is made easier by xref:databases-dev-services.adoc[Dev Services] because they require no configuration and start relatively quickly. However, it is also possible to use JVM-powered databases for scenarios when the ability to run simple integration tests is required.
ja_jp: 推奨されるアプローチは、本番環境にできるだけ近い結果を得るために、本番用のデータベースを使用することです。 xref:databases-dev-services.adoc[Dev Services ] を使用すると、設定が不要で、比較的短時間で開始できるため、この方法が容易になります。しかし、単純な統合テストを実行する機能が必要なシナリオでは、JVM を使用したデータベースを使用することも可能です。

source: The recommended approach is to use the real database you intend to use in production, especially when xref:databases-dev-services.adoc[Dev Services provide a zero-config database for testing], and running tests against a container is relatively quick and produces expected results on an actual environment. However, it is also possible to use JVM-powered databases for scenarios when the ability to run simple integration tests is required.
ja_jp: 特に、 xref:databases-dev-services.adoc[dev Services がテスト用のゼロコンフィグデータベースを提供して] おり、コンテナに対してテストを実行すると比較的短時間で実際の環境で期待通りの結果が得られる場合は、本番環境で使用する予定の実際のデータベースを使用することをお勧めします。しかし、単純な統合テストを実行する機能が必要なシナリオでは、JVM で動作するデータベースを使用することも可能です。

source: The recommended method for generating runtime profiling information is using the debug information rather than generating a binary that preserves the frame pointer. This is because adding debug information to the native executable build process has no negative runtime performance whereas preserving the frame pointer does.
ja_jp: 実行時プロファイリング情報を生成する方法としては、フレームポインタを保持したバイナリを生成するよりも、デバッグ情報を使用することを推奨します。これは、ネイティブ実行可能ファイルのビルドプロセスにデバッグ情報を追加しても、実行時のパフォーマンスには何の影響もないのに対し、フレームポインタの保持は影響があるためです。

source: The recommended version of GraalVM for Quarkus 1.11 is GraalVM 20.3.
ja_jp: Quarkus 1.11に対するGraalVMの推奨バージョンはGraalVM 20.3です。

source: The recommended version of GraalVM for Quarkus 1.12 is GraalVM 21.0.
ja_jp: Quarkus 1.12のGraalVMの推奨バージョンはGraalVM 21.0です。

source: The recommended version of GraalVM to use with Quarkus 2.2 is 21.2.
ja_jp: Quarkus 2.2で使用するGraalVMの推奨バージョンは21.2です。

source: The recommended way to expose configuration to a Quarkus application is by mapping it with an interface. With https://smallrye.io/smallrye-config/Main/config/mappings/[SmallRye Config Mappings], it is possible to group multiple configuration properties in a single interface that share the same prefix (or namespace). It supports the following set of features:
ja_jp: Quarkus アプリケーションに設定を公開するための推奨される方法は、インターフェースでマッピングすることです。 https://smallrye.io/smallrye-config/Main/config/mappings/[SmallRye Config Mappings] を使用すると、同じプレフィックス (または名前空間) を共有する複数の設定プロパティーを単一のインターフェースにグループ化できます。以下の機能セットをサポートしています。

source: The record written on the dead letter queue contains a set of additional headers about the original record:
ja_jp: デッドレターキューに書き込まれたレコードには、元のレコードに関する一連の追加ヘッダーが含まれています。

source: The recorder must be executed in the `ExecutionTime.RUNTIME_INIT` phase.
ja_jp: レコーダーは、 `ExecutionTime.RUNTIME_INIT` フェーズで実行する必要があります。

source: The reference documentation of Quarkus REST can be found xref:rest.adoc[here].
ja_jp: Quarkus REST のリファレンスドキュメントは xref:rest.adoc[こちら] にあります。

source: The reference documentation of RESTEasy Reactive can be found xref:resteasy-reactive.adoc[here].
ja_jp: RESTEasy Reactiveのリファレンスドキュメントは link:resteasy-reactive.html[こちら] でご覧いただけます。

source: The reflection service is enabled by default in _dev_ mode. In test or production mode, you need to enable it explicitly by setting `quarkus.grpc.server.enable-reflection-service` to `true`.
ja_jp: リフレクションサービスは、 _開発_ モードではデフォルトで有効になっています。テストモードやプロダクションモードでは、 `quarkus.grpc.server.enable-reflection-service` を `true` に設定して明示的に有効にする必要があります。

source: The registration system uses sensible defaults but also allows for fine-grained control per service.
ja_jp: 登録システムは適切なデフォルト値を使用しますが、サービスごとにきめ細かな制御を行うことも可能です。

source: The registry API
ja_jp: レジストリー API

source: The registry client configuration file is a simple YAML file which contains a list of registries, for example:
ja_jp: レジストリクライアント設定ファイルは、レジストリのリストを含むシンプルなYAMLファイルです。例えば以下のようになります:

source: The registry client is not logging much information by default. However, it does resolve various artifacts from Maven repositories behind the scenes. If you would like to see artifact transfer and other debugging related messages in the logs, you can enable the debug mode in the configuration. For example:
ja_jp: レジストリクライアントは、デフォルトでは多くの情報をログ出力していません。しかし、舞台裏でMavenリポジトリから様々なアーティファクトを解決します。アーティファクトの転送やその他のデバッグ関連のメッセージをログに記録したい場合は、設定でデバッグモードを有効にすることができます。例えば、以下のようになります:

source: The registry hosted at https://registry.quarkus.io[registry.quarkus.io] is a Maven __snapshot__ repository that provides platform and extension catalogs to the dev tools as Maven JSON artifacts. Once downloaded the extension catalogs will be cached in the user's local Maven repository and will be available to the dev tools even if the Internet network (or the registry itself) isn't available.
ja_jp: link:https://registry.quarkus.io[registry.quarkus.io] にあるレジストリは、Maven __スナップショット__ リポジトリであり、プラットフォームとエクステンションカタログをMaven JSONアーティファクトとして開発ツールに提供します。エクステンションカタログはダウンロードされると、ユーザーのローカルMavenリポジトリにキャッシュされ、インターネットネットワーク（またはレジストリ自体）が利用できない場合でも、開発ツールで利用できます。

source: The registry hosted at https://registry.quarkus.io[registry.quarkus.io] is the default Quarkus community extension registry. It is updated on every release of the https://github.com/quarkusio/quarkus-platform[Quarkus community platform] and includes extensions hosted on the https://github.com/quarkiverse[Quarkiverse Hub].
ja_jp: link:https://registry.quarkus.io[registry.quarkus.io] にあるレジストリは、デフォルトのQuarkusコミュニティエクステンションレジストリです。このレジストリは、 link:https://github.com/quarkusio/quarkus-platform[Quarkusコミュニティプラットフォーム] のリリースごとに更新され、 link:https://github.com/quarkiverse[Quarkiverse Hub] にホストされているエクステンションも含まれます。

source: The reload operation is not automatic and must be triggered manually. Additionally, the `TlsConfiguration` implementation must support reloading (which is the case for the configured certificate).
ja_jp: リロード操作は自動ではなく、手動でトリガーする必要があります。さらに、 `TlsConfiguration` 実装はリロードをサポートする必要があります (設定された証明書の場合)。

source: The reload operation is not automatic and must be triggered manually. Additionally, the `TlsConfiguration` implementation must support reloading, as is the case for the configured certificate.
ja_jp: リロード操作は自動ではなく、手動でトリガーする必要があります。 さらに、`TlsConfiguration` 実装はリロードをサポートする必要があります (設定された証明書の場合と同様)。

source: The remaining three properties in the `quarkus.oidc.credentials.client-secret.provider.*` namespace allow to customize how a custom xref:credentials-provider.adoc[CredentialsProvider] can be used to provide secrets stored in secure locations. Alternatively, you can use Quarkus Configuration system to manage secrets, see the xref:config-secrets.adoc[Secrets in Configuration] guide.
ja_jp: `quarkus.oidc.credentials.client-secret.provider.*` 名前空間の残りの 3 つのプロパティーを使用すると、安全な場所に保存されたシークレットを提供するために、カスタムの xref:credentials-provider.adoc[CredentialsProvider] をどのように使用するかをカスタマイズできます。あるいは、Quarkus 設定システムを使用してシークレットを管理することも可能です。詳細は xref:config-secrets.adoc[設定プロパティーでのシークレット] ガイドを参照してください。

source: The remaining three properties in the `quarkus.oidc.credentials.jwt.provider.*` namespace allow to customize how a custom xref:credentials-provider.adoc[CredentialsProvider] can be used to provide `quarkus.oidc.credentials.jwt.secret` secrets stored in secure locations. Alternatively, you can use Quarkus Configuration system to manage secrets, see the xref:config-secrets.adoc[Secrets in Configuration] guide.
ja_jp: `quarkus.oidc.credentials.jwt.provider.*` 名前空間の残りの 3 つのプロパティーを使用すると、安全な場所に保存された `quarkus.oidc.credentials.jwt.secret` シークレットを提供するために、カスタムの xref:credentials-provider.adoc[CredentialsProvider] をどのように使用するかをカスタマイズできます。あるいは、Quarkus 設定システムを使用してシークレットを管理することも可能です。詳細は xref:config-secrets.adoc[設定プロパティーでのシークレット] ガイドを参照してください。

source: The remote side does not need to include Maven or any other development tools. The normal `fast-jar` Dockerfile that is generated with a new Quarkus application is all you need. If you are using bare metal launch the Quarkus runner jar, do not attempt to run normal dev mode.
ja_jp: リモート側にはMavenなどの開発ツールを入れる必要はありません。新しいQuarkusアプリケーションで生成される通常の `fast-jar` Dockerfileがあれば大丈夫です。ベアメタルのQuarkus runner jarを起動している場合は、通常のdevmodeを実行しようとしないでください。

source: The remote side does not need to include Maven or any other development tools. The normal `fast-jar` Dockerfile that is generated with a new Quarkus application is all you need. If you are using bare metal launch the Quarkus runner jar, do not attempt to run normal devmode.
ja_jp: リモート側にはMavenなどの開発ツールを入れる必要はありません。新しいQuarkusアプリケーションで生成される通常の `fast-jar` Dockerfileがあれば大丈夫です。ベアメタルでQuarkus runner jarを起動している場合は、通常のdevmodeを実行しようとしないでください。

source: The render method (from `LitElement`) will be called to render the page. In this method, you return the markup of the page you want. You can use the `html` function from `Lit`, which gives you a template language to output the HTML you want. Once the template is created, you must only set or change the properties to re-render the page content. Read more about https://lit.dev/docs/components/rendering/[Lit html]
ja_jp: ページをレンダリングするために、render メソッドが (`LitElement` から) 呼び出されます。このメソッドでは、必要なページのマークアップを返します。 `Lit` の `html` 関数を使用すると、必要な HTML を出力するためのテンプレート言語を取得できます。テンプレートの作成後は、プロパティーを設定または変更するだけでページコンテンツを再レンダリングできます。詳細は、 https://lit.dev/docs/components/rendering/[Lit html] を参照してください。

source: The replier can be implemented using a Reactive Messaging processor (see <<processing-messages>>).
ja_jp: リプライヤーは、Reactive Messaging プロセッサーを使用して実装できます (<<processing-messages>> を参照)。

source: The reply we build up makes use of the caller name, the `isSecure()` and `getAuthenticationScheme()` states of the request `SecurityContext`, and whether a non-null `JsonWebToken` was injected.
ja_jp: 構築した応答では、呼び出し元の名前、リクエスト `SecurityContext` の `isSecure()` と `getAuthenticationScheme()` の状態、null 以外の `JsonWebToken` が挿入されたかどうかを利用します。

source: The reply we build up makes use of the caller name, the `isSecure()` and `getAuthenticationScheme()` states of the request `SecurityContext`.
ja_jp: 私たちが作成した応答では 呼出元の名前、リクエストの `SecurityContext` の `isSecure()` と `getAuthenticationScheme()` の状態を利用しています。

source: The report data (source directories and class files) are aggregated so that a single report can be generated.
ja_jp: レポートデータ (ソースディレクトリとクラスファイル) は、単一のレポートを生成できるように集計されます。

source: The report generated by `quarkus:info` is not currently including the Quarkus Maven plugin information, however it's planned to be added in the future releases.
ja_jp: `quarkus:info` によって生成されたレポートには、現在 Quarkus Maven プラグイン情報が含まれていませんが、将来のリリースで追加される予定です。

source: The reporting techniques specified in the xref:performance-measure.adoc[Measuring Performance guide] are applicable to native applications too, but what causes the RSS to be higher or lower is specific to how the generated native executables work.
ja_jp: xref:performance-measure.adoc[パフォーマンスの測定ガイド] で指定されているレポート手法は、ネイティブアプリケーションにも適用可能ですが、RSSが高くなったり低くなったりする原因は、生成されたネイティブ実行可能ファイルがどのように動作するかに特有のものです。

source: The reports will be created under `target/debugging-native-1.0.0-SNAPSHOT-native-image-source-jar/reports/`. These reports are some of the most useful resources when encountering issues with missing methods/classes, or encountering forbidden methods by Mandrel.
ja_jp: レポートは、 `target/debugging-native-1.0.0-SNAPSHOT-native-image-source-jar/reports/` の下に作成されます。これらのレポートは、メソッド/クラスが見つからない問題が発生した場合、または Mandrel によって禁止されたメソッドが発生した場合に、最も役立つリソースの一部になります。

source: The repository configuration below is shown only for illustrative purposes and does *NOT* have to be added to the user `settings.xml` or the application's `pom.xml`. The Quarkus dev tools come with this repository pre-configured.
ja_jp: 以下のリポジトリの設定は、説明のためだけに示されており、ユーザーの `settings.xml` やアプリケーションの `pom.xml` に追加する必要はありません。Quarkusの開発ツールには、このリポジトリがあらかじめ設定されています。

source: The repository type to store JBeret and Job data. A jdbc type requires a JDBC datasource.
ja_jp: JBeret および Job データを保存するためのリポジトリタイプです。JDBC タイプには JDBC データソースが必要です。

source: The request body can be injected into a method parameter annotated with `@io.quarkus.vertx.web.Body` using the following types:
ja_jp: リクエストボディは、以下の型を使用した、 `@io.quarkus.vertx.web.Body` でアノテーションされたメソッドパラメーターに注入することができます。

source: The request body can be injected into a method parameter annotated with `@io.quarkus.vertx.web.Body`.
ja_jp: リクエストボディは、 `@io.quarkus.vertx.web.Body` でアノテーションされたメソッドパラメーターに注入することができます。

source: The request body in a blocking stream
ja_jp: ブロッキングストリームのリクエストボディ

source: The request context is also active:
ja_jp: リクエストコンテキストは次の場合もアクティブになっています:

source: The request context is destroyed:
ja_jp: リクエストコンテキストは破棄されます:

source: The request is received by the `greeting` method
ja_jp: リクエストは、 `greeting` メソッドで受信されます。

source: The request is received by the `hello` method
ja_jp: リクエストは `hello` メソッドが受け取ります。

source: The request is rejected if a request matches one or more permission sets based on the path but does not match any due to method requirements.
ja_jp: リクエストがパスに基づいて1つ以上のパーミッションセットにマッチするが、 メソッドの要件によりマッチしない場合、そのリクエストは拒否されます。

source: The request is rejected if it matches one or more permission sets based on the path but none of the required methods.
ja_jp: パスに基づいて 1 つ以上の権限セットにマッチしても、必要なメソッドのいずれにもマッチしない場合、リクエストは拒否されます。

source: The request method publishes the record to the configured target topic of the outgoing channel, and polls a reply topic (by default, the target topic with `-replies` suffix) for a reply record. When the reply is received the returned `Uni` is completed with the record value. The request send operation generates a **correlation id** and sets a header (by default `REPLY_CORRELATION_ID`), which it expects to be sent back in the reply record.
ja_jp: リクエストメソッドは、レコードを送信チャネルの設定されたターゲットトピックに公開し、 返信レコードを取得するために返信トピック (デフォルトではターゲットトピックに `-replies` サフィックスを付けたもの) をポーリングします。 返信が受信されると、返された `Uni` はレコードの値で完了します。 リクエスト送信操作は、**コレレーション ID** を生成し、ヘッダー (デフォルトでは `REPLY_CORRELATION_ID`) を設定します。これは、返信レコードで返送されることが予想されます。

source: The request part of the HTTP call, consisting of an HTTP method, a target URI, headers and an optional message body
ja_jp: HTTP メソッド、ターゲット URI、ヘッダー、およびオプションのメッセージ・ボディで構成される HTTP 呼び出しのリクエスト部分。

source: The requests per second per replica
ja_jp: レプリカごとの 1 秒あたりのリクエスト数

source: The resolved route path is then associated with the key `quarkus.smallrye-openapi.path`.
ja_jp: そして、解決されたルートパスは、キー `quarkus.smallrye-openapi.path` に関連付けられます。

source: The resolved value of the `callable.url` property is `https://quarkus.io/`.
ja_jp: `callable.url` プロパティーの解決された値は `https://quarkus.io/` です。

source: The resource access permissions are configured directly in Keycloak, which eliminates the need for `@RolesAllowed` annotations in your application code. This approach centralizes access control management within Keycloak, simplifying application maintenance and security updates.
ja_jp: リソースのアクセス権限は Keycloak で直接設定されるため、アプリケーションコードに `@RolesAllowed` アノテーションを追加する必要がなくなります。 このアプローチにより、Keycloak 内でアクセス制御管理が集中化され、アプリケーションのメンテナンスとセキュリティー更新が簡素化されます。

source: The resource identifier URL scheme is set to `HTTPS` by default. You can enable an `HTTP` URL scheme with `quarkus.oidc.resource-metadata.force-https-scheme=false`, it can be particularly useful in simple demos and tests.
ja_jp: リソース識別子 URL のスキームは、デフォルトで `HTTPS` に設定されています。 `quarkus.oidc.resource-metadata.force-https-scheme=false` を設定すると `HTTP` URL スキームを有効にでき、これは単純なデモやテストで特に役立ちます。

source: The resource method `createOrUpdate` is only accessible for a user with both `create` and `update` permissions.
ja_jp: リソースメソッド `createOrUpdate` にアクセスできるのは、 `create` 権限と `update` 権限の両方を持つユーザーのみです。

source: The resource path, only relevant if `className` is set.
ja_jp: リソースパス、 `className` が設定されている場合のみ関連します。

source: The resource with added extensions now looks like this:
ja_jp: エクステンションを追加したリソースは次のようになります。

source: The response body is never compressed if:
ja_jp: 次の場合、レスポンスボディは圧縮されません。

source: The response body of a static resource is not compressed by default. You can enable the HTTP compression support by means of `quarkus.http.enable-compression=true`. If compression support is enabled then the response body is compressed if the `Content-Type` header derived from the file name of a resource is a compressed media type as configured via `quarkus.http.compress-media-types`.
ja_jp: 静的リソースのレスポンスボディは、デフォルトでは圧縮されません。 HTTP 圧縮のサポートは `quarkus.http.enable-compression=true` によって有効にすることができます。 圧縮サポートが有効な場合、リソースのファイル名から得られる `Content-Type` ヘッダーが `quarkus.http.compress-media-types` で設定された圧縮メディアタイプであれば、レスポンスボディは圧縮されます。

source: The response content may vary depending on the day you run the code.
ja_jp: コードを実行する日によってレスポンスの内容が異なる場合があります。

source: The response indicates that, in addition to the English page, there are a German and a French page about Quarkus on wikipedia.
ja_jp: 応答によると、ウィキペディアには英語のページに加え、ドイツ語とフランス語のQuarkusに関するページがあるとのことです。

source: The response is constructed similarly to the `hello` method, with the addition of the `birthdate` claim retrieved directly from the injected `JsonWebToken`.
ja_jp: レスポンスは `hello` メソッドと同様に構築されますが、挿入された `JsonWebToken` から直接取得された `birthdate` クレームが追加されます。

source: The response now includes the heroes of the film.
ja_jp: 今や、レスポンスには映画のヒーローたちも含まれています。

source: The response part of the HTTP call, consisting of an HTTP response status, headers and an optional message body
ja_jp: HTTP レスポンス・ステータス、ヘッダー、およびオプションのメッセージ・ボディで構成される、HTTP 呼び出しのレスポンス部分。

source: The response to send to the client instead of continuing the filter chain, or `null` if the filter chain should proceed
ja_jp: フィルターチェーンを続行する代わりにクライアントに送信するレスポンス、またはフィルターチェーンを続行する必要がある場合は null

source: The response to send to the client when the exception occurs
ja_jp: 例外が発生したときにクライアントに送信するレスポンス

source: The responses alternate between `Hello from Red!` and `Hello from Blue!`.
ja_jp: 応答は `Hello from Red!` と `Hello from Blue!` の間で交互に行われます。

source: The responses should alternate randomly between `Hello from Red!` and `Hello from Blue!`.
ja_jp: 応答は、 `Hello from Red!` と `Hello from Blue!` のいずれかがランダムに表示されます。
